### Name: A.Ch.Rohit
### Unique Id: E0320022

In [33]:
import mysql.connector

In [34]:
def mysql_connector():
    conn=mysql.connector.connect(
    host="localhost",
    user="root",
    password="rohit08",
    database="student_management")
    cur=conn.cursor()
    return conn,cur

In [2]:
import mysql.connector
conn=mysql.connector.connect(
host="localhost",
user="root",
password="rohit08",
database="student_management")
    
cur=conn.cursor()
    
val=[(1,"Rohit","A Ch",20),(2,"Kumaresh","N M",20),(3,"Adhithyan","B",20),(4,"Dhrish","S Kumar",20),(5,"Kirthana","Pati",20)]
qry='insert into students values(%s,%s,%s,%s)'
    
cur.executemany(qry,val)
conn.commit()
    
cur.execute("Select * from students")

for x in cur:
    print(x)
conn.close()

(1, 'Rohit', 'A Ch', 20)
(2, 'Kumaresh', 'N M', 20)
(3, 'Adhithyan', 'B', 20)
(4, 'Dhrish', 'S Kumar', 20)
(5, 'Kirthana', 'Pati', 20)

In [5]:
import mysql.connector
conn=mysql.connector.connect(
host="localhost",
user="root",
password="rohit08",
database="student_management")
    
cur=conn.cursor()
    
val=[(1,"Data Science"),(2,"Computer Vision"),(3,"Reinforcement Learning"),(4,"Tensorflow")]
qry='insert into courses values(%s,%s)'
    
cur.executemany(qry,val)
conn.commit()
    
cur.execute("Select * from courses")

for x in cur:
    print(x)
conn.close()

(1, 'Data Science')
(2, 'Computer Vision')
(3, 'Reinforcement Learning')
(4, 'Tensorflow')

In [9]:
import mysql.connector
conn=mysql.connector.connect(
host="localhost",
user="root",
password="rohit08",
database="student_management")
    
cur=conn.cursor()
    
val=[(1, 1, 1),
    (2, 2, 2),
    (3, 3, 1),
    (4, 4, 3),
    (5, 5, 4)]
qry='insert into enrollments values(%s,%s,%s)'
    
cur.executemany(qry,val)
conn.commit()
    

for x in cur:
    print(x)
conn.close()

(1, 'Data Science')
(2, 'Computer Vision')
(3, 'Reinforcement Learning')
(4, 'Tensorflow')

1. Retrieve the list of all students in the database, including their first names, last names,
and ages.

In [48]:
import mysql.connector
conn=mysql.connector.connect(
host="localhost",
user="root",
password="rohit08",
database="student_management")
    
cur=conn.cursor()
    
cur.execute("Select first_name,last_name,age from students")

for x in cur:
    print(x)
conn.close()

('Rohit', 'A Ch', 20)
('Kumaresh', 'N M', 20)
('Adhithyan', 'B', 20)
('Dhrish', 'S Kumar', 20)
('Kirthana', 'Pati', 20)
('Virat', 'Kohli', 32)
('Rohit', 'Sharma', 32)
('John', 'Cena', 35)
('John', 'Wick', 19)

2. Find the names of students who are older than 25 years.

In [16]:
import mysql.connector
conn=mysql.connector.connect(
host="localhost",
user="root",
password="rohit08",
database="student_management")
    
cur=conn.cursor()
    
cur.execute("Select first_name,last_name,age from students where age>25")
for x in cur:
    print(x)
conn.close()

('Virat', 'Kohli', 32)
('Rohit', 'Sharma', 32)

3. List the courses that have at least 5 enrollments.

In [81]:
import mysql.connector
conn=mysql.connector.connect(
host="localhost",
user="root",
password="rohit08",
database="student_management")
    
cur=conn.cursor()
    
cur.execute("select c.course_name,j.cnt from courses c join (Select course_id,count(enrollment_id) as cnt from enrollments group by course_id having count(enrollment_id)>=5)j on c.course_id=j.course_id")
for x in cur:
    print(x)
conn.close()

('Tensorflow', 5)

4. Retrieve the courses in which a specific student (by student ID) is enrolled.

In [25]:
import mysql.connector
conn=mysql.connector.connect(
host="localhost",
user="root",
password="rohit08",
database="student_management")
    
cur=conn.cursor()
    
cur.execute("Select e.student_id,e.course_id,c.course_name from courses c join enrollments e on c.course_id=e.course_id where student_id=3")
print('(s.student_id,e.course_id,c.course_name)')
for x in cur:
    print(x)
conn.close()

(s.student_id,e.course_id,c.course_name)
(3, 1, 'Data Science')
(3, 4, 'Tensorflow')

5. Find the average age of all students.

In [84]:
import mysql.connector
conn=mysql.connector.connect(
host="localhost",
user="root",
password="rohit08",
database="student_management")
    
cur=conn.cursor()
    
cur.execute("Select avg(age) as Average_Age from students")
print('(Average_Age)')
for x in cur:
    print(x)
conn.close()

(Average_Age)
(Decimal('24.2222'),)

6. List the students who are enrolled in a specific course (by course ID).

In [32]:
import mysql.connector
conn=mysql.connector.connect(
host="localhost",
user="root",
password="rohit08",
database="student_management")
    
cur=conn.cursor()
    
cur.execute("Select s.first_name,s.last_name,e.course_id from students s join enrollments e on s.student_id=e.student_id where e.course_id=4")
print('(s.first_name,s.last_name,e.course_id)')
for x in cur:
    print(x)
conn.close()

(s.first_name,s.last_name,e.course_id)
('Kirthana', 'Pati', 4)
('Rohit', 'A Ch', 4)
('Kumaresh', 'N M', 4)
('Adhithyan', 'B', 4)
('Dhrish', 'S Kumar', 4)

7. Retrieve the students who have the same first names (e.g., find all students with the
first name &quot;John&quot;).

In [36]:
conn,cur=mysql_connector()
qry='insert into students values(%s,%s,%s,%s)'
val=[(8,"John","Cena",35),(9,"John","Wick",19)]
cur.executemany(qry,val)
conn.commit()
cur.execute("select * from students")
for x in cur:
    print(x)
cur.close()

(1, 'Rohit', 'A Ch', 20)
(2, 'Kumaresh', 'N M', 20)
(3, 'Adhithyan', 'B', 20)
(4, 'Dhrish', 'S Kumar', 20)
(5, 'Kirthana', 'Pati', 20)
(6, 'Virat', 'Kohli', 32)
(7, 'Rohit', 'Sharma', 32)
(8, 'John', 'Cena', 35)
(9, 'John', 'Wick', 19)

True

In [50]:
conn,cur=mysql_connector()
cur.execute('select * from students where first_name in (select first_name from students group by first_name having count(first_name) > 1)')
print("(student_id,first_name,last_name,age)")
for x in cur:
    print(x)
cur.close()

(student_id,first_name,last_name,age)
(1, 'Rohit', 'A Ch', 20)
(7, 'Rohit', 'Sharma', 32)
(8, 'John', 'Cena', 35)
(9, 'John', 'Wick', 19)

True

8. Count the number of courses each student is enrolled in and list the students along
with their course counts.

In [53]:
conn,cur=mysql_connector()
cur.execute('Select s.student_id,s.first_name,s.last_name,count(e.course_id) as number_of_courses_enrolled from students s join enrollments e on s.student_id=e.student_id group by e.student_id ')
for x in cur:
    print(x)
cur.close()

(1, 'Rohit', 'A Ch', 2)
(2, 'Kumaresh', 'N M', 2)
(3, 'Adhithyan', 'B', 2)
(4, 'Dhrish', 'S Kumar', 2)
(5, 'Kirthana', 'Pati', 1)

True

9. Find the courses with no enrollments.

In [55]:
conn,cur=mysql_connector()
cur.execute("select * from courses where course_id not in (select course_id from enrollments)")
for x in cur:
    print(x)
cur.close()

(5, 'Placement')

True

10. Retrieve the courses with enrollments exceeding the average enrollment count.

In [79]:
conn,cur=mysql_connector()
cur.execute("select c.course_id,c.course_name,sub.cnt from courses c join (select course_id, count(course_id) as cnt from enrollments c2 group by course_id having count(course_id) >(select avg(enroll_count) from (select count(course_id) as enroll_count from enrollments group by course_id) c2))sub on c.course_id=sub.course_id")
print("(c.course_id,c.course_name,sub.cnt)")
for x in cur:
    print(x)
cur.close()

(c.course_id,c.course_name,sub.cnt)
(4, 'Tensorflow', 5)

True